import { ProductScanResult } from "@/constants/responses";
import { Severity } from "@/enums/scan-result-with-ai";

export const cacheProductData: ProductScanResult = {
  status: 1,
  score: 28,
  image_url:
    "https://images.openfoodfacts.org/images/products/611/103/100/5064/front_fr.9.400.jpg",
  recommendations: [
    {
      recommendation:
        "ينبغي تقليل كمية السكر والدهون المشبعة للحفاظ على صحة القلب والأوعية الدموية، خصوصًا مع المحتوى العالي من السكريات والدهون المشبعة في المنتج.",
      severity: Severity.HIGH,
      explanation:
        "المنتج يحتوي على نسبة عالية من السكريات (40 غرام لكل 100 غرام) والدهون المشبعة (10.9 غرام لكل 100 غرام)، وهو ما يرفع من خطر الإصابة بأمراض القلب والسكري ويزيد من السمنة، كما أنه محمل بالمواد المصنعة والإضافات، مما يجعله غير ملائم للاستهلاك بشكل منتظم.",
    },
    {
      recommendation:
        "يجب تحسين جودة المكونات وتقليل استخدام المكونات المعالجة والمواد الحافظة والإضافات الصناعية لزيادة درجة الأمان الصحي للمنتج.",
      severity: Severity.HIGH,
      explanation:
        "المنتج يحتوي على العديد من المكونات المعالجة والمواد المضافة مثل السكر الاصطناعي والمواد الهيدروجينية والمواد الكيميائية التي تقلل من جودة و سلامتة المنتج، مما يهدد صحة المستهلك على المدى الطويل.",
    },
    {
      recommendation:
        "يفضل استهلاك المنتجات ذات المكونات الطبيعية والأقل معالجة، والاعتماد على الأطعمة التي تحتوي على ألياف وبروتين عاليين، وتقليل تناول الأطعمة عالية السكر والدهون المشبعة.",
      severity: Severity.MODERATE,
      explanation:
        "المنتج يحتوي على 0.43 غرام ألياف و4.35 غرام بروتين لكل 100 غرام، وهي نسب منخفضة نسبياً، مما يقلل من شعور الشبع ويؤثر على عملية الهضم والصحة العامة. من الأفضل استبداله بمنتجات طبيعية أكثر غنى بالألياف والبروتين.",
    },
  ],
  product_name: "Tonik",
};
